** offsetof
#+BEGIN_SRC C
#define offsetof(type, member) (size_t)&(((type*)0)->member)
#+END_SRC

offsetof (type,member)

Return member offset

This macro with functional form returns the offset value in bytes of member member in the data structure or union type type.

Example:
#+BEGIN_SRC C
#include <stdio.h>
#ifndef offsetof
#define offsetof(TYPE,MEMBER)((size_t)&((TYPE*)0)->MEMBER)
#endif
struct ST
{
    int i;
    char c;
    int j;
};

void func (struct ST* pst)
{
    int* pi=&(pst->i); //(unsigned int)&s+0;
    int* pj=&(pst->j); //(unsigned int)&s+4;
    char* pc=&(pst->c);//(unsigned int)&s+8;

    printf("pst = %p \n",pst);
    printf("pi = %p \n",pi);
    printf("pc = %p \n",pc);
    printf("pj = %p \n",pj);
}

int main(int argc, char *argv[])
{
    struct ST s={0};
    func(&s);
    printf("--------\n");
    func(NULL);
    printf("--------\n");
    printf("offset i: %d \n",offsetof(struct ST,i));
    printf("offset c: %d \n",offsetof(struct ST,c));
    printf("offset j: %d \n",offsetof(struct ST,j));
    printf("Hello World!\n");
    return 0;
}
#+END_SRC

#+RESULTS:
| pst      | =      | 0x7ffdeb42bdbc |
| pi       | =      | 0x7ffdeb42bdbc |
| pc       | =      | 0x7ffdeb42bdc0 |
| pj       | =      | 0x7ffdeb42bdc4 |
| -------- |        |                |
| pst      | =      |          (nil) |
| pi       | =      |          (nil) |
| pc       | =      |            0x4 |
| pj       | =      |            0x8 |
| -------- |        |                |
| offset   | i:     |              0 |
| offset   | c:     |              4 |
| offset   | j:     |              8 |
| Hello    | World! |                |

*** typeof()?
Only working in compile phase.
#+BEGIN_SRC C
int i=100;
typeof(i) j=i; //int j=i
const typeof(i)* p=&j; //const int* p=&j;
#+END_SRC
#+BEGIN_SRC C :tangle typeof.c
  #include <stdio.h>
  void type_of()
  {
      int i=100;
      typeof(i) j=i;
      const typeof(j)* p=&j;

      printf("sizeof(j) = %d \n",(int)sizeof(j));
      printf("j = %d\n",j);
      printf("p = %d \n", *p);
  }
  void main()
  {
    type_of();
  }
#+END_SRC

#+RESULTS:
| sizeof(j) | = |   4 |
| j         | = | 100 |
| p         | = | 100 |
*** Example:
#+BEGIN_SRC C
#include <stdio.h>
#define offsetof(type, member) (size_t)&(((type*)0)->member)

#ifndef container_of
#define container_of(ptr,type,member)({\
    const typeof(((type*) 0)->member)* __mptr=(ptr);    \
    (type*)((char*)__mptr-offsetof(type,member));    \
})
#endif

#ifndef container_of_simple
    #define container_of_simple(ptr,type,member)  ((type*)((char*)ptr-offsetof(type,member)))
#endif
struct ST
{
    int i;
    char c;
    int j;
};
void comma_operator_common_C()
{
    int a=0;
    int b=0;
    int r=(
                a=1,
                b=2,
                a+b
                );
    printf("r = %d \n",r);

}
void GNU_extended_C()
{
    int r=({
               int a=1;
               int b=2;
               a+b;
           });
    printf("r = %d \n",r);
}
void type_of()
{
    int i=100;
    typeof(i) j=i;
    const typeof(j)* p=&j;

    printf("sizeof(j) = %d \n",(int)sizeof(j));
    printf("j = %d\n",j);
    printf("p = %d \n", *p);
}

int main(int argc, char *argv[])
{
    printf("Hello World!\n");
    comma_operator_common_C();
    GNU_extended_C();
    type_of();

    struct ST s={0};
    char* pc=&s.c;
    struct ST* pst=container_of(pc, struct ST,c);
    printf("&s=%p\n",&s);
    printf("pst=%p\n",pst);

    struct ST* pst_simple=container_of_simple(pc,struct ST,c);
    printf("pst_simple=%p\n",pst_simple);

    //Datatype check (unsafe)
    int e=0;
    int *pe=&e;
    struct ST* pst_error=container_of_simple(pe,struct ST,c);
    printf("pst_error=%p\n",pst_error);

    //compile warning
    struct ST* pst_error_report=container_of(pe,struct ST,c);
    printf("pst_error_report=%p\n",pst_error_report);

    return 0;
}
#+END_SRC

#+RESULTS:
| Hello                           | World! |     |
| r                               | =      |   3 |
| r                               | =      |   3 |
| sizeof(j)                       | =      |   4 |
| j                               | =      | 100 |
| p                               | =      | 100 |
| &s=0x7fff0c8e6f0c               |        |     |
| pst=0x7fff0c8e6f0c              |        |     |
| pst_simple=0x7fff0c8e6f0c       |        |     |
| pst_error=0x7fff0c8e6ec0        |        |     |
| pst_error_report=0x7fff0c8e6ec0 |        |     |

